<?php
    $sleep = rand(1,7);
	$code = rand() % 3;
	sleep($sleep);
	if($code == 2) {
	    header('HTTP/1.1 500 error ');
		exit; 
	}
?>
{
"code":<?php if($code == 0) {echo 200;} else {echo 400;}?>,
"data": "<p>-------------------------------------------------------------------------------------------------------------</p><p>人生若只如初见，何事秋风悲画扇，等闲变却故人心，却道故人心易变！ </p><p>-------------------------------------------------------------------------------------------------------------</p><p>骊山语罢清宵半，泪雨零铃终不怨。何如薄幸锦衣郎，比翼连枝当日愿。</p>"
}